CoreMaker-lab/STM32C542_LSM6DSK320X_LIS2MDL/STM32C5_LSM6DSK320X_Project6/STM32C542CC_LSM6DSK320X_LIS2MDL_Project6_cmake/lsm6dsk320x_reg.h
#define LSM6DSK320X_ODR_TRIG_CFG                   0x6U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t odr_trig_nodr                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr_trig_nodr                : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_odr_trig_cfg_t;

#define LSM6DSK320X_FIFO_CTRL1                     0x7U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wtm                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wtm                          : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_fifo_ctrl1_t;

#define LSM6DSK320X_FIFO_CTRL2                     0x8U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used2                    : 1;
  uint8_t uncompr_rate                 : 2;
  uint8_t not_used0                    : 1;
  uint8_t odr_chg_en                   : 1;
  uint8_t not_used1                    : 1;
  uint8_t fifo_compr_rt_en             : 1;
  uint8_t stop_on_wtm                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t stop_on_wtm                  : 1;
  uint8_t fifo_compr_rt_en             : 1;
  uint8_t not_used1                    : 1;
  uint8_t odr_chg_en                   : 1;
  uint8_t not_used0                    : 1;
  uint8_t uncompr_rate                 : 2;
  uint8_t not_used2                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_fifo_ctrl2_t;

#define LSM6DSK320X_FIFO_CTRL3                     0x9U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bdr_xl                       : 4;
  uint8_t bdr_gy                       : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bdr_gy                       : 4;
  uint8_t bdr_xl                       : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_fifo_ctrl3_t;

#define LSM6DSK320X_FIFO_CTRL4                     0x0AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_mode                    : 3;
  uint8_t g_eis_fifo_en                : 1;
  uint8_t odr_t_batch                  : 2;
  uint8_t dec_ts_batch                 : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dec_ts_batch                 : 2;
  uint8_t odr_t_batch                  : 2;
  uint8_t g_eis_fifo_en                : 1;
  uint8_t fifo_mode                    : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_fifo_ctrl4_t;

#define LSM6DSK320X_COUNTER_BDR_REG1               0x0BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t cnt_bdr_th                   : 2;
  uint8_t not_used0                    : 1;
  uint8_t xl_hg_batch_en               : 1;
  uint8_t not_used2                    : 1;
  uint8_t trig_counter_bdr             : 2;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t trig_counter_bdr             : 2;
  uint8_t not_used2                    : 1;
  uint8_t xl_hg_batch_en               : 1;
  uint8_t not_used0                    : 1;
  uint8_t cnt_bdr_th                   : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_counter_bdr_reg1_t;

#define LSM6DSK320X_COUNTER_BDR_REG2               0x0CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t cnt_bdr_th                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t cnt_bdr_th                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_counter_bdr_reg2_t;

#define LSM6DSK320X_INT1_CTRL                      0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_drdy_xl                 : 1;
  uint8_t int1_drdy_g                  : 1;
  uint8_t not_used0                    : 1;
  uint8_t int1_fifo_th                 : 1;
  uint8_t int1_fifo_ovr                : 1;
  uint8_t int1_fifo_full               : 1;
  uint8_t int1_cnt_bdr                 : 1;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t int1_cnt_bdr                 : 1;
  uint8_t int1_fifo_full               : 1;
  uint8_t int1_fifo_ovr                : 1;
  uint8_t int1_fifo_th                 : 1;
  uint8_t not_used0                    : 1;
  uint8_t int1_drdy_g                  : 1;
  uint8_t int1_drdy_xl                 : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_int1_ctrl_t;

#define LSM6DSK320X_INT2_CTRL                      0x0EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_drdy_xl                 : 1;
  uint8_t int2_drdy_g                  : 1;
  uint8_t int2_drdy_g_eis              : 1;
  uint8_t int2_fifo_th                 : 1;
  uint8_t int2_fifo_ovr                : 1;
  uint8_t int2_fifo_full               : 1;
  uint8_t int2_cnt_bdr                 : 1;
  uint8_t int2_emb_func_endop          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_emb_func_endop          : 1;
  uint8_t int2_cnt_bdr                 : 1;
  uint8_t int2_fifo_full               : 1;
  uint8_t int2_fifo_ovr                : 1;
  uint8_t int2_fifo_th                 : 1;
  uint8_t int2_drdy_g_eis              : 1;
  uint8_t int2_drdy_g                  : 1;
  uint8_t int2_drdy_xl                 : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_int2_ctrl_t;

#define LSM6DSK320X_WHO_AM_I                       0x0FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t id                           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t id                           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_who_am_i_t;

#define LSM6DSK320X_CTRL1                          0x10U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t odr_xl                       : 4;
  uint8_t op_mode_xl                   : 3;
  uint8_t not_used0                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t op_mode_xl                   : 3;
  uint8_t odr_xl                       : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_ctrl1_t;

#define LSM6DSK320X_CTRL2                          0x11U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t odr_g                        : 4;
  uint8_t op_mode_g                    : 3;
  uint8_t not_used0                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t op_mode_g                    : 3;
  uint8_t odr_g                        : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_ctrl2_t;

#define LSM6DSK320X_CTRL3                          0x12U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sw_reset                     : 1;
  uint8_t not_used0                    : 1;
  uint8_t if_inc                       : 1;
  uint8_t not_used1                    : 3;
  uint8_t bdu                          : 1;
  uint8_t boot                         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot                         : 1;
  uint8_t bdu                          : 1;
  uint8_t not_used1                    : 3;
  uint8_t if_inc                       : 1;
  uint8_t not_used0                    : 1;
  uint8_t sw_reset                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_ctrl3_t;

#define LSM6DSK320X_CTRL4                          0x13U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_in_lh                   : 1;
  uint8_t drdy_pulsed                  : 1;
  uint8_t int2_drdy_temp               : 1;
  uint8_t drdy_mask                    : 1;
  uint8_t int2_on_int1                 : 1;
  uint8_t not_used0                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t int2_on_int1                 : 1;
  uint8_t drdy_mask                    : 1;
  uint8_t int2_drdy_temp               : 1;
  uint8_t drdy_pulsed                  : 1;
  uint8_t int2_in_lh                   : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_ctrl4_t;

#define LSM6DSK320X_CTRL5                          0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int_en_i3c                   : 1;
  uint8_t bus_act_sel                  : 2;
  uint8_t not_used0                    : 4;
  uint8_t if2_ta0_pid                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_ta0_pid                  : 1;
  uint8_t not_used0                    : 4;
  uint8_t not_used0                    : 4;
  uint8_t bus_act_sel                  : 2;
  uint8_t int_en_i3c                   : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dsk320x_ctrl5_t;

