CoreMaker-lab/STM32C542_LSM6DSK320X_LIS2MDL/STM32C5_LSM6DSK320X_Project6/STM32C542CC_LSM6DSK320X_LIS2MDL_Project6_cmake/lsm6dsk320x_reg.h
typedef enum
{
  LSM6DSK320X_250dps  = 0x1,
  LSM6DSK320X_500dps  = 0x2,
  LSM6DSK320X_1000dps = 0x3,
  LSM6DSK320X_2000dps = 0x4,
  LSM6DSK320X_4000dps = 0x5,
} lsm6dsk320x_gy_full_scale_t;

/**
  * @brief  Gyroscope full-scale selection[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      250dps, 500dps, 1000dps, 2000dps, 4000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_gy_full_scale_t val);

/**
  * @brief  Gyroscope full-scale selection[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      250dps, 500dps, 1000dps, 2000dps, 4000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_gy_full_scale_t *val);

typedef enum
{
  LSM6DSK320X_2g  = 0x0,
  LSM6DSK320X_4g  = 0x1,
  LSM6DSK320X_8g  = 0x2,
  LSM6DSK320X_16g = 0x3,
} lsm6dsk320x_xl_full_scale_t;

/**
  * @brief  Accelerometer full-scale selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      2g, 4g, 8g, 16g,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_xl_full_scale_t val);

/**
  * @brief  Accelerometer full-scale selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      2g, 4g, 8g, 16g,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_xl_full_scale_t *val);

typedef enum
{
  LSM6DSK320X_32g  = 0x0,
  LSM6DSK320X_64g  = 0x1,
  LSM6DSK320X_128g = 0x2,
  LSM6DSK320X_256g = 0x3,
  LSM6DSK320X_320g = 0x4,
} lsm6dsk320x_hg_xl_full_scale_t;

/**
   * @brief  Accelerometer HG full-scale selection.[set]
   *
   * @param  ctx      read / write interface definitions
   * @param  val      lsm6dsk320x_hg_xl_full_scale_t
   * @retval          interface status (MANDATORY: return 0 -> no Error)
   *
   */
int32_t lsm6dsk320x_hg_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                         lsm6dsk320x_hg_xl_full_scale_t val);

/**
  * @brief  Accelerometer HG full-scale selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsk320x_hg_xl_full_scale_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_hg_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                         lsm6dsk320x_hg_xl_full_scale_t *val);

typedef enum
{
  LSM6DSK320X_ST_DISABLE  = 0x0,
  LSM6DSK320X_ST_POSITIVE = 0x1,
  LSM6DSK320X_ST_NEGATIVE = 0x2,
} lsm6dsk320x_self_test_t;

/**
  * @brief  Accelerometer self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_xl_self_test_set(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t val);

/**
  * @brief  Accelerometer self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_xl_self_test_get(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t *val);

/**
  * @brief  IF2 Accelerometer self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_xl_self_test_set(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t val);

/**
  * @brief  IF2 Accelerometer self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_xl_self_test_get(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t *val);

/**
  * @brief  Gyroscope self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_gy_self_test_set(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t val);

/**
  * @brief  Gyroscope self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_gy_self_test_get(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t *val);

/**
  * @brief  HG XL self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_hg_xl_self_test_set(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t val);

/**
  * @brief  HG XL self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      ST_DISABLE, ST_POSITIVE, ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_hg_xl_self_test_get(const stmdev_ctx_t *ctx, lsm6dsk320x_self_test_t *val);

typedef enum
{
  LSM6DSK320X_OIS_GY_ST_DISABLE   = 0x0,
  LSM6DSK320X_OIS_GY_ST_POSITIVE  = 0x1,
  LSM6DSK320X_OIS_GY_ST_NEGATIVE  = 0x2,
  LSM6DSK320X_OIS_GY_ST_CLAMP_POS = 0x5,
  LSM6DSK320X_OIS_GY_ST_CLAMP_NEG = 0x6,

} lsm6dsk320x_ois_gy_self_test_t;

/**
  * @brief  IF2 Accelerometer self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_ST_DISABLE, GY_ST_POSITIVE, GY_ST_NEGATIVE, LSM6DSK320X_OIS_GY_ST_CLAMP_POS, LSM6DSK320X_OIS_GY_ST_CLAMP_NEG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_gy_self_test_set(const stmdev_ctx_t *ctx,
                                         lsm6dsk320x_ois_gy_self_test_t val);

/**
  * @brief  IF2 Accelerometer self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_ST_DISABLE, GY_ST_POSITIVE, GY_ST_NEGATIVE, LSM6DSK320X_OIS_GY_ST_CLAMP_POS, LSM6DSK320X_OIS_GY_ST_CLAMP_NEG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_gy_self_test_get(const stmdev_ctx_t *ctx,
                                         lsm6dsk320x_ois_gy_self_test_t *val);

typedef struct
{
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_gy                      : 1;
  uint8_t drdy_temp                    : 1;
  uint8_t drdy_xlhgda                  : 1;
  uint8_t drdy_eis                     : 1;
  uint8_t drdy_ois                     : 1;
  uint8_t gy_settling                  : 1;
  uint8_t timestamp                    : 1;
  uint8_t hg                           : 1;
  uint8_t free_fall                    : 1;
  uint8_t wake_up                      : 1;
  uint8_t wake_up_z                    : 1;
  uint8_t wake_up_y                    : 1;
  uint8_t wake_up_x                    : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t tap_z                        : 1;
  uint8_t tap_y                        : 1;
  uint8_t tap_x                        : 1;
  uint8_t tap_sign                     : 1;
  uint8_t six_d                        : 1;
  uint8_t six_d_xl                     : 1;
  uint8_t six_d_xh                     : 1;
  uint8_t six_d_yl                     : 1;
  uint8_t six_d_yh                     : 1;
  uint8_t six_d_zl                     : 1;
  uint8_t six_d_zh                     : 1;
  uint8_t sleep_change                 : 1;
  uint8_t sleep_state                  : 1;
  uint8_t step_detector                : 1;
  uint8_t step_count_inc               : 1;
  uint8_t step_count_overflow          : 1;
  uint8_t step_on_delta_time           : 1;
  uint8_t emb_func_stand_by            : 1;
  uint8_t emb_func_time_exceed         : 1;
  uint8_t tilt                         : 1;
  uint8_t sig_mot                      : 1;
  uint8_t fsm_lc                       : 1;
  uint8_t fsm1                         : 1;
  uint8_t fsm2                         : 1;
  uint8_t fsm3                         : 1;
  uint8_t fsm4                         : 1;
  uint8_t fsm5                         : 1;
  uint8_t fsm6                         : 1;
  uint8_t fsm7                         : 1;
  uint8_t fsm8                         : 1;
  uint8_t mlc1                         : 1;
  uint8_t mlc2                         : 1;
  uint8_t mlc3                         : 1;
  uint8_t mlc4                         : 1;
  uint8_t mlc5                         : 1;
  uint8_t mlc6                         : 1;
  uint8_t mlc7                         : 1;
  uint8_t mlc8                         : 1;
  uint8_t sh_endop                     : 1;
  uint8_t sh_target0_nack              : 1;
  uint8_t sh_target1_nack              : 1;
  uint8_t sh_target2_nack              : 1;
  uint8_t sh_target3_nack              : 1;
  uint8_t sh_wr_once                   : 1;
  uint8_t fifo_bdr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_th                      : 1;
} lsm6dsk320x_all_sources_t;

/**
  * @brief  Get the status of all the interrupt sources.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Get the status of all the interrupt sources.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_all_sources_get(const stmdev_ctx_t *ctx,
                                    lsm6dsk320x_all_sources_t *val);


typedef struct
{
  uint8_t drdy_hgxl                    : 1;
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_gy                      : 1;
  uint8_t drdy_temp                    : 1;
} lsm6dsk320x_data_ready_t;

/**
  * @brief  Data Ready event.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0: no data ready event, 1: data ready event occoured
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                        lsm6dsk320x_data_ready_t *val);

/**
  * @brief  Mask status bit reset[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Mask to prevent status bit being reset
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_int_ack_mask_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Mask status bit reset[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Mask to prevent status bit being reset
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_int_ack_mask_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Temperature data output register[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Temperature data output register
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  Angular rate sensor.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Angular rate sensor.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  Angular rate sensor.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS Angular rate sensor (thru IF2).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  Angular rate sensor for OIS gyro or the EIS gyro channel.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Angular rate sensor for OIS gyro or the EIS gyro channel.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_eis_angular_rate_raw_get(const stmdev_ctx_t *ctx,
                                                 int16_t *val);

/**
  * @brief  Linear acceleration sensor.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Linear acceleration sensor.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  Linear acceleration sensor for OIS channel mode.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Linear acceleration sensor or OIS channel mode.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  Linear acceleration sensor for hg channel mode.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Linear acceleration sensor or High-G channel mode.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_hg_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  SFLP gbias.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SFLP gbias raw array.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_gbias_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  SFLP gravity.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SFLP gravity raw array.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_gravity_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

/**
  * @brief  SFLP raw quaternions.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      pointer to SFLP quaternions raw array.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_quaternion_raw_get(const stmdev_ctx_t *ctx, uint16_t *val);

/**
  * @brief  Difference in percentage of the effective ODR (and timestamp rate) with respect to the typical. Step: 0.13%. 8-bit format, 2's complement.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Difference in percentage of the effective ODR (and timestamp rate) with respect to the typical. Step: 0.13%. 8-bit format, 2's complement.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_odr_cal_reg_get(const stmdev_ctx_t *ctx, int8_t *val);

/**
  * @defgroup  Common Common Functions
  * @brief     This section groups common useful functions.
  * @{/
  *
  */

/**
  * @brief  Disable Embedded functions.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      1 (disable) or 0 (enable) embedded functions
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_disable_embedded_function_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Disable Embedded functions.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      1 (disable) or 0 (enable) embedded functions
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_disable_embedded_function_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t xl_hg_conv_en                : 1;
  uint8_t gyro_conv_en                 : 1;
  uint8_t temp_conv_en                 : 1;
  uint8_t ext_sensor_conv_en           : 1;
} lsm6dsk320x_emb_func_conv_t;

/**
  * @brief  Enable/Disable embedded function sensor conversion.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0 (disable) or 1 (enable) embedded functions sensor conversion
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_emb_func_conv_set(const stmdev_ctx_t *ctx, lsm6dsk320x_emb_func_conv_t val);

/**
  * @brief  Enable/Disable embedded function sensor conversion.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0 (disable) or 1 (enable) embedded functions sensor conversion
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_emb_func_conv_get(const stmdev_ctx_t *ctx, lsm6dsk320x_emb_func_conv_t *val);

/**
  * @brief  Write buffer in a page.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Write buffer in a page.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t address,
                                uint8_t *buf, uint8_t len);

/**
  * @brief  Read buffer in a page.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Write buffer in a page.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ln_pg_read(const stmdev_ctx_t *ctx, uint16_t address, uint8_t *buf,
                               uint8_t len);

/**
  * @brief  Enable debug mode for embedded functions [set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0, 1
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_emb_function_dbg_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enable debug mode for embedded functions [get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0, 1
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_emb_function_dbg_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  DEN Data Enable (DEN) Configuration
  * @brief     This section groups all the functions concerning
  *            DEN functionality.
  * @{
  *
  */

