CoreMaker-lab/STM32C542_LSM6DSK320X_LIS2MDL/STM32C5_LSM6DSK320X_Project6/STM32C542CC_LSM6DSK320X_LIS2MDL_Project6_cmake/lsm6dsk320x_reg.h
typedef enum
{
  LSM6DSK320X_CMP_DISABLE = 0x0,
  LSM6DSK320X_CMP_8_TO_1  = 0x1,
  LSM6DSK320X_CMP_16_TO_1 = 0x2,
  LSM6DSK320X_CMP_32_TO_1 = 0x3,
} lsm6dsk320x_fifo_compress_algo_t;

/**
  * @brief  It configures the compression algorithm to write non-compressed data at each rate.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      CMP_DISABLE, CMP_ALWAYS, CMP_8_TO_1, CMP_16_TO_1, CMP_32_TO_1,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_compress_algo_set(const stmdev_ctx_t *ctx,
                                           lsm6dsk320x_fifo_compress_algo_t val);

/**
  * @brief  It configures the compression algorithm to write non-compressed data at each rate.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      CMP_DISABLE, CMP_ALWAYS, CMP_8_TO_1, CMP_16_TO_1, CMP_32_TO_1,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_compress_algo_get(const stmdev_ctx_t *ctx,
                                           lsm6dsk320x_fifo_compress_algo_t *val);

/**
  * @brief  Enables ODR CHANGE virtual sensor to be batched in FIFO.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables ODR CHANGE virtual sensor to be batched in FIFO.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                                  uint8_t val);

/**
  * @brief  Enables ODR CHANGE virtual sensor to be batched in FIFO.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables ODR CHANGE virtual sensor to be batched in FIFO.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                                  uint8_t *val);

/**
  * @brief  Enables/Disables compression algorithm runtime.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables/Disables compression algorithm runtime.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_compress_algo_real_time_set(const stmdev_ctx_t *ctx,
                                                     uint8_t val);

/**
  * @brief  Enables/Disables compression algorithm runtime.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables/Disables compression algorithm runtime.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_compress_algo_real_time_get(const stmdev_ctx_t *ctx,
                                                     uint8_t *val);

typedef enum
{
  LSM6DSK320X_FIFO_EV_WTM             = 0x0,
  LSM6DSK320X_FIFO_EV_FULL            = 0x1,
} lsm6dsk320x_fifo_event_t;

/**
  * @brief  Sensing chain FIFO stop values memorization at threshold level.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensing chain FIFO stop values memorization at threshold level.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, lsm6dsk320x_fifo_event_t val);

/**
  * @brief  Sensing chain FIFO stop values memorization at threshold level.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensing chain FIFO stop values memorization at threshold level.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx, lsm6dsk320x_fifo_event_t *val);

typedef enum
{
  LSM6DSK320X_XL_NOT_BATCHED       = 0x0,
  LSM6DSK320X_XL_BATCHED_AT_1Hz875 = 0x1,
  LSM6DSK320X_XL_BATCHED_AT_7Hz5   = 0x2,
  LSM6DSK320X_XL_BATCHED_AT_15Hz   = 0x3,
  LSM6DSK320X_XL_BATCHED_AT_30Hz   = 0x4,
  LSM6DSK320X_XL_BATCHED_AT_60Hz   = 0x5,
  LSM6DSK320X_XL_BATCHED_AT_120Hz  = 0x6,
  LSM6DSK320X_XL_BATCHED_AT_240Hz  = 0x7,
  LSM6DSK320X_XL_BATCHED_AT_480Hz  = 0x8,
  LSM6DSK320X_XL_BATCHED_AT_960Hz  = 0x9,
  LSM6DSK320X_XL_BATCHED_AT_1920Hz = 0xa,
  LSM6DSK320X_XL_BATCHED_AT_3840Hz = 0xb,
  LSM6DSK320X_XL_BATCHED_AT_7680Hz = 0xc,
} lsm6dsk320x_fifo_xl_batch_t;

/**
  * @brief  Selects Batch Data Rate (write frequency in FIFO) for accelerometer data.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_NOT_BATCHED, XL_BATCHED_AT_1Hz875, XL_BATCHED_AT_7Hz5, XL_BATCHED_AT_15Hz, XL_BATCHED_AT_30Hz, XL_BATCHED_AT_60Hz, XL_BATCHED_AT_120Hz, XL_BATCHED_AT_240Hz, XL_BATCHED_AT_480Hz, XL_BATCHED_AT_960Hz, XL_BATCHED_AT_1920Hz, XL_BATCHED_AT_3840Hz, XL_BATCHED_AT_7680Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_fifo_xl_batch_t val);

/**
  * @brief  Selects Batch Data Rate (write frequency in FIFO) for accelerometer data.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_NOT_BATCHED, XL_BATCHED_AT_1Hz875, XL_BATCHED_AT_7Hz5, XL_BATCHED_AT_15Hz, XL_BATCHED_AT_30Hz, XL_BATCHED_AT_60Hz, XL_BATCHED_AT_120Hz, XL_BATCHED_AT_240Hz, XL_BATCHED_AT_480Hz, XL_BATCHED_AT_960Hz, XL_BATCHED_AT_1920Hz, XL_BATCHED_AT_3840Hz, XL_BATCHED_AT_7680Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_fifo_xl_batch_t *val);

typedef enum
{
  LSM6DSK320X_GY_NOT_BATCHED       = 0x0,
  LSM6DSK320X_GY_BATCHED_AT_1Hz875 = 0x1,
  LSM6DSK320X_GY_BATCHED_AT_7Hz5   = 0x2,
  LSM6DSK320X_GY_BATCHED_AT_15Hz   = 0x3,
  LSM6DSK320X_GY_BATCHED_AT_30Hz   = 0x4,
  LSM6DSK320X_GY_BATCHED_AT_60Hz   = 0x5,
  LSM6DSK320X_GY_BATCHED_AT_120Hz  = 0x6,
  LSM6DSK320X_GY_BATCHED_AT_240Hz  = 0x7,
  LSM6DSK320X_GY_BATCHED_AT_480Hz  = 0x8,
  LSM6DSK320X_GY_BATCHED_AT_960Hz  = 0x9,
  LSM6DSK320X_GY_BATCHED_AT_1920Hz = 0xa,
  LSM6DSK320X_GY_BATCHED_AT_3840Hz = 0xb,
  LSM6DSK320X_GY_BATCHED_AT_7680Hz = 0xc,
} lsm6dsk320x_fifo_gy_batch_t;

/**
  * @brief  Selects Batch Data Rate (write frequency in FIFO) for gyroscope data.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_NOT_BATCHED, GY_BATCHED_AT_1Hz875, GY_BATCHED_AT_7Hz5, GY_BATCHED_AT_15Hz, GY_BATCHED_AT_30Hz, GY_BATCHED_AT_60Hz, GY_BATCHED_AT_120Hz, GY_BATCHED_AT_240Hz, GY_BATCHED_AT_480Hz, GY_BATCHED_AT_960Hz, GY_BATCHED_AT_1920Hz, GY_BATCHED_AT_3840Hz, GY_BATCHED_AT_7680Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_gy_batch_set(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_fifo_gy_batch_t val);

/**
  * @brief  Selects Batch Data Rate (write frequency in FIFO) for gyroscope data.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GY_NOT_BATCHED, GY_BATCHED_AT_1Hz875, GY_BATCHED_AT_7Hz5, GY_BATCHED_AT_15Hz, GY_BATCHED_AT_30Hz, GY_BATCHED_AT_60Hz, GY_BATCHED_AT_120Hz, GY_BATCHED_AT_240Hz, GY_BATCHED_AT_480Hz, GY_BATCHED_AT_960Hz, GY_BATCHED_AT_1920Hz, GY_BATCHED_AT_3840Hz, GY_BATCHED_AT_7680Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_gy_batch_get(const stmdev_ctx_t *ctx,
                                      lsm6dsk320x_fifo_gy_batch_t *val);

/**
  * @brief  Enable FIFO Batch for hg XL data.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0 (disable) / 1 (enabled)
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_hg_xl_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enable FIFO Batch for hg XL data.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0 (disable) / 1 (enabled)
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_fifo_hg_xl_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

