CoreMaker-lab/STM32C542_LSM6DSK320X_LIS2MDL/STM32C5_LSM6DSK320X_Project6/STM32C542CC_LSM6DSK320X_LIS2MDL_Project6_cmake/lsm6dsk320x_reg.h
typedef enum
{
  LSM6DSK320X_HP_MD_NORMAL_SLOPE_ON     = 0x2,
  LSM6DSK320X_HP_MD_NORMAL_SLOPE_OFF    = 0x0,
  LSM6DSK320X_HP_MD_REFERENCE           = 0x3,
} lsm6dsk320x_filt_xl_hp_mode_t;

/**
  * @brief  Accelerometer high-pass filter mode.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      HP_MD_NORMAL_SLOPE_ON, HP_MD_NORMAL_SLOPE_OFF HP_MD_REFERENCE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_xl_hp_mode_set(const stmdev_ctx_t *ctx,
                                        lsm6dsk320x_filt_xl_hp_mode_t val);

/**
  * @brief  Accelerometer high-pass filter mode.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      HP_MD_NORMAL_SLOPE_ON, HP_MD_NORMAL_SLOPE_OFF, HP_MD_REFERENCE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_xl_hp_mode_get(const stmdev_ctx_t *ctx,
                                        lsm6dsk320x_filt_xl_hp_mode_t *val);

typedef enum
{
  LSM6DSK320X_WK_FEED_SLOPE          = 0x0,
  LSM6DSK320X_WK_FEED_HIGH_PASS      = 0x1,
  LSM6DSK320X_WK_FEED_LP_WITH_OFFSET = 0x3,
} lsm6dsk320x_filt_wkup_act_feed_t;

/**
  * @brief  HPF or SLOPE filter selection on wake-up and Activity/Inactivity functions.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      WK_FEED_SLOPE, WK_FEED_HIGH_PASS, WK_FEED_LP_WITH_OFFSET,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_wkup_act_feed_set(const stmdev_ctx_t *ctx,
                                           lsm6dsk320x_filt_wkup_act_feed_t val);

/**
  * @brief  HPF or SLOPE filter selection on wake-up and Activity/Inactivity functions.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      WK_FEED_SLOPE, WK_FEED_HIGH_PASS, WK_FEED_LP_WITH_OFFSET,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_wkup_act_feed_get(const stmdev_ctx_t *ctx,
                                           lsm6dsk320x_filt_wkup_act_feed_t *val);

/**
  * @brief  Mask hw function triggers when xl is settling.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0 or 1,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_mask_trigger_xl_settl_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Mask hw function triggers when xl is settling.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0 or 1,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_mask_trigger_xl_settl_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSK320X_SIXD_FEED_ODR_DIV_2 = 0x0,
  LSM6DSK320X_SIXD_FEED_LOW_PASS  = 0x1,
} lsm6dsk320x_filt_sixd_feed_t;

/**
  * @brief  LPF2 filter on 6D (sixd) function selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SIXD_FEED_ODR_DIV_2, SIXD_FEED_LOW_PASS,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_sixd_feed_set(const stmdev_ctx_t *ctx,
                                       lsm6dsk320x_filt_sixd_feed_t val);

/**
  * @brief  LPF2 filter on 6D (sixd) function selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SIXD_FEED_ODR_DIV_2, SIXD_FEED_LOW_PASS,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_sixd_feed_get(const stmdev_ctx_t *ctx,
                                       lsm6dsk320x_filt_sixd_feed_t *val);

typedef enum
{
  LSM6DSK320X_EIS_LP_NORMAL = 0x0,
  LSM6DSK320X_EIS_LP_LIGHT  = 0x1,
} lsm6dsk320x_filt_gy_eis_lp_bandwidth_t;

/**
  * @brief  Gyroscope digital LPF_EIS filter bandwidth selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      EIS_LP_NORMAL, EIS_LP_LIGHT,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_gy_eis_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                 lsm6dsk320x_filt_gy_eis_lp_bandwidth_t val);

/**
  * @brief  Gyroscope digital LPF_EIS filter bandwidth selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      EIS_LP_NORMAL, EIS_LP_LIGHT,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_gy_eis_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                 lsm6dsk320x_filt_gy_eis_lp_bandwidth_t *val);

typedef enum
{
  LSM6DSK320X_OIS_GY_LP_NORMAL     = 0x0,
  LSM6DSK320X_OIS_GY_LP_STRONG     = 0x1,
  LSM6DSK320X_OIS_GY_LP_AGGRESSIVE = 0x2,
  LSM6DSK320X_OIS_GY_LP_LIGHT      = 0x3,
} lsm6dsk320x_filt_gy_ois_lp_bandwidth_t;

/**
  * @brief  Gyroscope OIS digital LPF1 filter bandwidth selection. This function works also on OIS interface (IF2_CTRL2_OIS = UI_CTRL2_OIS).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_GY_LP_NORMAL, OIS_GY_LP_STRONG, OIS_GY_LP_AGGRESSIVE, OIS_GY_LP_LIGHT,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_gy_ois_lp_bandwidth_set(const stmdev_ctx_t *ctx,
                                                 lsm6dsk320x_filt_gy_ois_lp_bandwidth_t val);

/**
  * @brief  Gyroscope OIS digital LPF1 filter bandwidth selection. This function works also on OIS interface (IF2_CTRL2_OIS = UI_CTRL2_OIS).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_GY_LP_NORMAL, OIS_GY_LP_STRONG, OIS_GY_LP_AGGRESSIVE, OIS_GY_LP_LIGHT,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_filt_gy_ois_lp_bandwidth_get(const stmdev_ctx_t *ctx,
                                                 lsm6dsk320x_filt_gy_ois_lp_bandwidth_t *val);

