CoreMaker-lab/STM32C542_LSM6DSK320X_LIS2MDL/STM32C5_LSM6DSK320X_Project6/STM32C542CC_LSM6DSK320X_LIS2MDL_Project6_cmake/lsm6dsk320x_reg.h
typedef enum
{
  LSM6DSK320X_OIS_250dps  = 0x1,
  LSM6DSK320X_OIS_500dps  = 0x2,
  LSM6DSK320X_OIS_1000dps = 0x3,
  LSM6DSK320X_OIS_2000dps = 0x4,
} lsm6dsk320x_ois_gy_full_scale_t;

/**
  * @brief  Gyroscope OIS full-scale selection[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_250dps, OIS_500dps, OIS_1000dps, OIS_2000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                          lsm6dsk320x_ois_gy_full_scale_t val);

/**
  * @brief  Gyroscope OIS full-scale selection[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_250dps, OIS_500dps, OIS_1000dps, OIS_2000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                          lsm6dsk320x_ois_gy_full_scale_t *val);

typedef enum
{
  LSM6DSK320X_OIS_2g  = 0x0,
  LSM6DSK320X_OIS_4g  = 0x1,
  LSM6DSK320X_OIS_8g  = 0x2,
  LSM6DSK320X_OIS_16g = 0x3,
} lsm6dsk320x_ois_xl_full_scale_t;

/**
  * @brief  Selects accelerometer OIS channel full-scale.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_2g, OIS_4g, OIS_8g, OIS_16g,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                          lsm6dsk320x_ois_xl_full_scale_t val);

/**
  * @brief  Selects accelerometer OIS channel full-scale.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_2g, OIS_4g, OIS_8g, OIS_16g,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ois_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                          lsm6dsk320x_ois_xl_full_scale_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  6D_4D 6D (and 4D) Orientation Configuration
  * @brief     This section groups all the functions concerning six position
  *            detection (6D).
  * @{
  *
  */

typedef enum
{
  LSM6DSK320X_DEG_80 = 0x0,
  LSM6DSK320X_DEG_70 = 0x1,
  LSM6DSK320X_DEG_60 = 0x2,
  LSM6DSK320X_DEG_50 = 0x3,
} lsm6dsk320x_6d_threshold_t;

/**
  * @brief  Threshold for 4D/6D function.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEG_80, DEG_70, DEG_60, DEG_50,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_6d_threshold_set(const stmdev_ctx_t *ctx,
                                     lsm6dsk320x_6d_threshold_t val);

/**
  * @brief  Threshold for 4D/6D function.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEG_80, DEG_70, DEG_60, DEG_50,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_6d_threshold_get(const stmdev_ctx_t *ctx,
                                     lsm6dsk320x_6d_threshold_t *val);

/**
  * @brief  4D orientation detection enable. Z-axis position detection is disabled.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      4D orientation detection enable. Z-axis position detection is disabled.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  4D orientation detection enable. Z-axis position detection is disabled.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      4D orientation detection enable. Z-axis position detection is disabled.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  I3C SenseWire (I3C) Configuration
  * @brief     This section group all the functions concerning the
  *            usage of SenseWire (I3C)
  * @{
  *
  */
typedef enum
{
  LSM6DSK320X_I2C_I3C_ENABLE  = 0x0,
  LSM6DSK320X_I2C_I3C_DISABLE = 0x1,
} lsm6dsk320x_ui_i2c_i3c_mode_t;

/**
  * @brief  Disables I2C and I3C on UI (User Interface).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      I2C_I3C_ENABLE, I2C_I3C_DISABLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ui_i2c_i3c_mode_set(const stmdev_ctx_t *ctx,
                                        lsm6dsk320x_ui_i2c_i3c_mode_t val);

/**
  * @brief  Disables I2C and I3C on UI (User Interface).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      I2C_I3C_ENABLE, I2C_I3C_DISABLE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ui_i2c_i3c_mode_get(const stmdev_ctx_t *ctx,
                                        lsm6dsk320x_ui_i2c_i3c_mode_t *val);

typedef struct
{
  uint8_t if2_ta0_pid                  : 1;
  enum
  {
    LSM6DSK320X_SW_RST_DYN_ADDRESS_RST = 0x0,
    LSM6DSK320X_I3C_GLOBAL_RST         = 0x1,
  } rst_mode;
  enum
  {
    LSM6DSK320X_IBI_50us = 0x0,
    LSM6DSK320X_IBI_2us  = 0x1,
    LSM6DSK320X_IBI_1ms  = 0x2,
    LSM6DSK320X_IBI_50ms = 0x3,
  } ibi_time;
} lsm6dsk320x_i3c_config_t;

/**
  * @brief  I3C configuration.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      rst_mode, ibi_time, if2_ta0_pid
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_i3c_config_set(const stmdev_ctx_t *ctx,
                                   lsm6dsk320x_i3c_config_t val);

/**
  * @brief  I3C configuration.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      rst_mode, ibi_time, if2_ta0_pid
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_i3c_config_get(const stmdev_ctx_t *ctx,
                                   lsm6dsk320x_i3c_config_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  SH Sensor hub Configuration
  * @brief     This section groups all the functions that manage the
  *            sensor hub.
  * @{
  *
  */

/**
  * @brief  Sensor Hub controller I2C pull-up enable.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor Hub controller I2C pull-up enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sh_controller_interface_pull_up_set(const stmdev_ctx_t *ctx,
                                                        uint8_t val);

/**
  * @brief  Sensor Hub controller I2C pull-up enable.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor Hub controller I2C pull-up enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sh_controller_interface_pull_up_get(const stmdev_ctx_t *ctx,
                                                        uint8_t *val);

/**
  * @brief  Sensor hub output registers.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor hub output registers.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sh_read_data_raw_get(const stmdev_ctx_t *ctx, uint8_t *val,
                                         uint8_t len);

