CoreMaker-lab/STM32C542_LSM6DSK320X_LIS2MDL/STM32C5_LSM6DSK320X_Project6/STM32C542CC_LSM6DSK320X_LIS2MDL_Project6_cmake/lsm6dsk320x_reg.h
typedef enum
{
  LSM6DSK320X_PAD_LOW_STRENGTH     = 0x0,
  LSM6DSK320X_PAD_MIDDLE_STRENGTH  = 0x1,
  LSM6DSK320X_PAD_HIGH_STRENGTH    = 0x3,
} lsm6dsk320x_pad_strength_t;

/**
  * @brief  Pad strength.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Pad strength
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_pad_strength_set(const stmdev_ctx_t *ctx, lsm6dsk320x_pad_strength_t val);

/**
  * @brief  Pad strength.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Pad strength
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_pad_strength_get(const stmdev_ctx_t *ctx, lsm6dsk320x_pad_strength_t *val);

typedef enum
{
  LSM6DSK320X_SPI_4_WIRE = 0x0,
  LSM6DSK320X_SPI_3_WIRE = 0x1,
} lsm6dsk320x_spi_mode_t;

/**
  * @brief  SPI Serial Interface Mode selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SPI_4_WIRE, SPI_3_WIRE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_spi_mode_set(const stmdev_ctx_t *ctx, lsm6dsk320x_spi_mode_t val);

/**
  * @brief  SPI Serial Interface Mode selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SPI_4_WIRE, SPI_3_WIRE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_spi_mode_get(const stmdev_ctx_t *ctx, lsm6dsk320x_spi_mode_t *val);

/**
  * @brief  Enables pull-up on SDA pin.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables pull-up on SDA pin.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ui_sda_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables pull-up on SDA pin.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables pull-up on SDA pin.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_ui_sda_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  IF2 (OIS Inteface) Serial Interface Mode selection. This function works also on OIS (UI_CTRL1_OIS = IF2_CTRL1_OIS).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SPI_4_WIRE, SPI_3_WIRE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_if2_spi_mode_set(const stmdev_ctx_t *ctx, lsm6dsk320x_spi_mode_t val);

/**
  * @brief  IF2 (OIS Inteface) Serial Interface Mode selection. This function works also on OIS (UI_CTRL1_OIS = IF2_CTRL1_OIS).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SPI_4_WIRE, SPI_3_WIRE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_if2_spi_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dsk320x_spi_mode_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Sigmot Significant motion detection Configuration
  * @brief     This section groups all the functions that manage the
  *            significant motion detection.
  * @{
  *
  */

/**
  * @brief  Enables significant motion detection function.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables significant motion detection function.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sigmot_mode_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables significant motion detection function.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables significant motion detection function.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sigmot_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Pedometer Step Counter (Pedometer) Configuration
  * @brief     This section groups all the functions that manage pedometer.
  * @{
  *
  */

typedef struct
{
  uint8_t step_counter_enable          : 1;
  uint8_t false_step_rej               : 1;
} lsm6dsk320x_stpcnt_mode_t;

/**
  * @brief  Step counter mode[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Step counter mode
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dsk320x_stpcnt_mode_t val);

/**
  * @brief  Step counter mode[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      false_step_rej, step_counter, step_detector,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dsk320x_stpcnt_mode_t *val);

/**
  * @brief  Step counter output, number of detected steps.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Step counter output, number of detected steps.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_steps_get(const stmdev_ctx_t *ctx, uint16_t *val);

/**
  * @brief  Reset step counter.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Reset step counter.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_rst_step_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Reset step counter.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Reset step counter.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_rst_step_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Pedometer debounce configuration.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Pedometer debounce configuration.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_debounce_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Pedometer debounce configuration.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Pedometer debounce configuration.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_debounce_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Time period register for step detection on delta time.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Time period register for step detection on delta time.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_period_set(const stmdev_ctx_t *ctx, uint16_t val);

/**
  * @brief  Time period register for step detection on delta time.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Time period register for step detection on delta time.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_stpcnt_period_get(const stmdev_ctx_t *ctx, uint16_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  SFLP Sensor Fusion Low Power (SFLP) Configuration
  * @brief     This section groups all the functions that manage pedometer.
  * @{
  *
  */

/**
  * @brief  Enable SFLP Game Rotation Vector (6x).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable/Disable game rotation value (0/1).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_game_rotation_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enable SFLP Game Rotation Vector (6x).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable/Disable game rotation value (0/1).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_game_rotation_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Reset SFLP Game Rotation Vector logic (6x).
  *
  * @param  ctx      read / write interface definitions
  * @param  val      1: reset, 0: stop reset procedure
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_game_rotation_reset(const stmdev_ctx_t *ctx, uint8_t val);

typedef struct
{
  float_t gbias_x; /* dps */
  float_t gbias_y; /* dps */
  float_t gbias_z; /* dps */
} lsm6dsk320x_sflp_gbias_t;

/**
  * @brief  SFLP GBIAS value. The register value is expressed as half-precision
  *         floating-point format: SEEEEEFFFFFFFFFF (S: 1 sign bit; E: 5 exponent
  *          bits; F: 10 fraction bits).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      GBIAS x/y/z val.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_game_gbias_set(const stmdev_ctx_t *ctx,
                                        const lsm6dsk320x_sflp_gbias_t *val);

typedef struct
{
  float_t quat_w;
  float_t quat_x;
  float_t quat_y;
  float_t quat_z;
} lsm6dsk320x_quaternion_t;

/**
  * @brief  SFLP quaternions.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      pointer to SFLP quaternions raw array.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsk320x_sflp_quaternion_get(const stmdev_ctx_t *ctx, lsm6dsk320x_quaternion_t *quat);

